{
    "about": "About",
    "quality": "Quality",
    "greeting": "Hello!",
    "tech": "Tech Stack",
    "seeDemo": "See demo",
    "diplomas": "Dîplomes",
    "passion": "Passions",
    "parcour": "Education",
    "projects": "Projects",
    "missions": "Missions",
    "repository": "Repository",
    "experience":"Experiences",
    "myProjects": "My projects",
    "chatgpt": "ChatGpt",
    "audienceTargeting": "Audience Targeting",
    "personaGenerator": "Persona Generator",
    "chromeExtension": "Chrome Extension",
    "whatItDoes": "App Overview",
    "screenshoot": "Screenshoot",
    "Functionnality": "Functionnality",
    "academicCarrer": "Academic career",
    "professionalProjects": "Professional project",
    "experienceAndProjects": "Experiences & Projects",
    "description": "This is a simple React-Intl example.",
    "cvDescription": "As a full-stack developer, I am passionate about creation of innovative technological solutions to meet the needs of customers and end users. I am an expert in the design, development and maintenance of websites and applications, from front-end to back-end.",
    
    "projectVatsyOverview": "This app is designed to make restaurant management effortless and efficient. With its user-friendly and intuitive interface, staff can easily take orders, manage payments, and streamline everyday operations—all from one platform. The app ensures a smooth and fast service, allowing restaurants to focus on what matters most: providing a great dining experience. The app’s simple and reliable features help staff stay organized with real-time order tracking, stock management, and quick access to sales reports. It even keeps a clear transaction history, making financial tracking a breeze. Whether you're in a busy rush or need a quick update, everything is just a few taps away. With a focus on ease of use, this app is perfect for restaurants looking to enhance productivity and improve service quality. Plus, with built-in support and clear instructions.",
    "projectVatsyMission1": "Design and development of a restaurant management application with Tauri, React and SQlite",
    "projectVatsyMission2": "Implementation of an ergonomic and responsive user interface for taking orders and managing payments.",
    "projectVatsyMission3": "Integration of a 58 mm thermal printer with the escpos-rs library for printing additions.",
    "projectVatsyMission4": "Configuration and optimization of thermal printing parameters for reliable and fast rendering.",
    "projectVatsyMission5": "Testing and debugging to ensure a smooth user experience in real conditions.",
    "projectVatsyMission6": "Development of modules for inventory management, menus and orders in real time.",
    "projectVatsyMission7": "Implemented features for transaction history and daily sales reports.",
    "projectVatsyMission8": "Writing technical documentation to facilitate maintenance and future developments of the application.",
    "projectVatsyMission9": "Implementation of technical support for end users.",

    "projectVatsyInvoicePrinting": "Invoice printing",
    "projectVatsyOrderManagement": "Order Management",
    "projectVatsyTransactionHistory": "Transaction history",
    "projectVatsySearchEngine": "Search engine",

    "projectKonsistentOverview": "This is a Chrome extension, similar to Grammarly, designed to facilitate communication between staff members across various organizations. Its primary purpose is to prevent sexual harassment, moral harassment, and exclusion in the workplace. The extension is available on both web and desktop platforms.",
    "projectKonsistentMission1": "Addition of new exclusion rules based on message sending times, in order to prevent messages from being sent too late or too early, thereby protecting the privacy of employees.",
    "projectKonsistentMission2": "Implementation of an asymmetric data encryption feature to ensure the security and confidentiality of information.",
    "projectKonsistentMission3": "Design and development of the project in desktop version, aimed at reaching a large number of users.",
    "projectKonsistentMission4": "Real-time detection of user input, ensuring accurate and immediate results.",
    "projectKonsistentMission5": "Adding Microsoft Outlook, Slack, and Welcome to the Jungle as analysis channels in the Chrome extension,expanding execution channels to reach a larger number of users.",

    "projectHapticOverview": "This is an innovative desktop application designed to simplify the creation of haptic materials with just a few clicks. Featuring an intuitive interface, it allows users to manipulate and adjust key perceptions such as texture, vibration, and stiffness, providing an immersive and customizable experience. This groundbreaking solution, recently acquired by Razer, is aimed at developers and creators looking to integrate realistic haptic sensations into their products.",
    "projectHapticMission1": "Developed the project's architecture using Electron and antd, ensuring a high-performance, responsive, and scalable interface",
    "projectHapticMission2": "Integrated user interfaces based on Adobe XD mockups, meticulously adhering to design specifications and optimizing the user experience for smooth and intuitive navigation.",
    "projectHapticMission3": "Wrote and executed Jest tests to ensure the proper functionality of DLL (Dynamic Link Libraries), ensuring code reliability, stability, and comprehensive coverage while quickly identifying potential issues.",
    "projectHapticMission4": "Designed and developed the MainView for texture perception, acting as the core component and backbone of the interface, enabling interaction with various project functionalities while ensuring optimal performance and responsiveness.",
    "projectHapticMission5": "Integrated the zoom feature into the MainView, allowing users to achieve greater precision when visualizing and adjusting melodies and notes, offering enhanced control and a better user experience.",
    "projectHapticMission6": "Developed and implemented the drag-and-drop feature for placing predefined notes on the MainView, making it easier for users to organize and manipulate elements within the interface, while ensuring smooth and intuitive interactions.",
    "projectHapticMission7": "Designed and developed essential features like Undo/Redo, Copy/Paste, Move Note, and Glue Note, enabling precise and efficient manipulation of elements via keyboard shortcuts, providing maximum flexibility for users in managing notes and project modifications. The integration of keyboard shortcuts ensures a fast and intuitive experience, reducing the time needed for element manipulation within the interface.",

    "projectYoomumOverview": "A mobile application available on Android and iOS, designed to support expectant mothers throughout their pregnancy journey. The app allows users to easily find healthcare facilities (hospitals, clinics, pharmacies, etc.) near their location. Additionally, it enables the creation and discovery of personalized events, promoting connections and well-being for mothers-to-be.",
    "projectYoomumMission1": "Integration of retrofit 2 to replace an outdated PHP module, thereby optimizing API call management. This overhaul improved code performance and maintainability, while ensuring smoother and more efficient communication between the client and the server.",
    "projectYoomumMission2": "Analysis and optimization of the proper functioning of existing features, identifying and addressing any issues while ensuring their long-term stability and efficiency.",
    "projectYoomumMission3": "Implementation of a Single Sign-On (SSO) system for account creation and authentication, streamlining access to the application while ensuring a smooth and secure user experience.",

    "projectMarketerOverview": "Development of a web application to launch personalized advertising campaigns on social networks (Facebook, Gmail, YouTube, LinkedIn), providing centralized and optimized ad management to effectively reach target audiences.",
    "projectMarketerMission1": "Definition of the conceptual data model to ensure consistent data management, optimizing system scalability and performance.",
    "projectMarketerMission2": "Creation and enhancement of the registration and authentication pages to improve user experience and simplify access to the application.",
    "projectMarketerMission3": "Setup of a cron job for the regular retrieval of Facebook insights, automating data analysis.",
    "projectMarketerMission4": "Use of corresponding SDKs on each channel to create targeted campaigns and ads, optimizing reach and ad effectiveness across different platforms.",
    "projectMarketerMission5": "Definition of core items parameters for personas, such as demographics, interests, and behaviors, for precise and personalized persona targeting.",

    "project4MpOverview": "Chain for Wallet is a blockchain-based application that enables secure transactions with the COIN, CCOIN, and CCOIN cryptocurrencies. It provides a reliable and transparent platform for managing digital assets, ensuring secure exchanges and an intuitive interface for users.",
    "project4MpMission1":"Creation of the FAQ page to quickly answer frequently asked questions, reducing the need for direct support and making information more accessible.",
    "project4MpMission2":"Fixing the bug related to balance display, ensuring correct and real-time updates of the user's financial information.",
    "project4MpMission3":"Implementation of a custom identifier for login, allowing the user to sign in with a combination of letters and numbers instead of using their email and password.",
    "project4MpSubTitle": "Feedback Corrections",

    "projectAdomOverview": "A web application dedicated to the complete management of purchasing and delivering goods during the COVID-19 lockdown period, providing an efficient and secure solution to meet users' needs during this exceptional time.",
    "projectAdmoMission1": "Modification of personal information to allow users to update their data easily and securely, thereby improving data accuracy and enhancing the user experience.",
    "projectAdmoMission2": "Add, modify, delete, and view my delivery addresses, enabling flexible and personalized management of delivery information, ensuring a smooth and convenient user experience.",
    "projectAdmoMission3": "Enhancement of the authentication page, order creation page, order confirmation page, order summary page, order list page, express delivery option, and payment page to improve interactivity and streamline the user experience at each stage of the process.",
    
    "projectBuyerPersonaOverview": "This project is designed to test the integration of ChatGPT with a Chrome extension. The primary goal is to streamline the creation of buyer personas, allowing users to generate them with fewer clicks, improving both efficiency and user experience.",
    "projectBuyerPersonaMission1": "Integrating the screens ensures smooth and intuitive navigation for the user, delivering an optimal experience and enabling faster adoption of the extension.",
    "projectBuyerPersonaMission2": "Setting up the Express server centralizes API calls and ensures fast, reliable responses, facilitating seamless communication between the extension and ChatGPT, ultimately enhancing the overall performance of the project.",

    "projectLappsysOverview": "This innovative application is designed to centralize the management of establishments, beneficiaries, and interventions within a single tool. It allows users to seamlessly and efficiently manage all processes related to beneficiaries and interventions, while providing an optimized user experience through simple and intuitive features. The goal is to enhance productivity, transparency, and coordination, while ensuring optimal care and response to needs.",
    "projectLappsysTitle": "Resolution of potential application bugs : ",
    "projectLappsysMission1": "Generation of the intervention report",
    "projectLappsysMission2": "Bug d'exportation PDF",
    "projectLappsysMission3": "Download pictures and files of establishment and beneficaries",
    "projectLappsysMission4": "Upload de la signature bénéficiaire sur l'application mobile",
    "projectLappsysMission5": "Mise à jour en temps réel sur l'application mobile",
    "projectLappsysMission6": "Importer la liste des bénéficiaires depuis Excel",
    "projectLappsysMission7": "Filtrer les intervenants et les bénéficiaires surla planification",

    "projectIttsOverview": "An web application for traveling with families",
    "projectIttsMission1": "Mettre en place le service de payement stripe",
    "projectIttsMission2": "Envoie automatique d'email (inscription, confirmation de payement, newsLetter)",
    "projectIttsMission3": "Mise en œuvre d'une interface utilisateur ergonomique et responsive pour la reservation et la gestion des paiements.",
    "projectIttsMission4": "Conception du model conceptuel de donnee",

    "projectOsawOverview": "Application web de référencement des sociétés et établissements malagasy par géolocalisation, développé avec laravel et React.",
    "projectOsawMission1": "Conception et gestion des routes pour la navigation entre les pages de l'application.",
    "projectOsawMission2": "Integration de la page d'acceuil avec un map de madagascar ainsi que les 26 regions cliquable pour permettre a l'utilisateur de filtrer ces recherche.",
    "projectOsawMission3": "Affichage par defaut de quelques etablissement (Pharmacie, Poste de Police, Hopital) sur la map pour une interaction plus ergonomique et rapide.",
    "projectOsawMission4": "Mise en place des modeles concuptuel de donnees (Societe, Annexe, Evenement, Information, Produit) pour assurer une structure optimale des donnees sauvegarder.",
    "projectOsawMission5": "Integration et affichage des evenements avec geolocalisation afin d'aider l'utilisateur a reserver directement son billet sans plus se soucier de la localisation.",
    "projectOsawMission6": "Affichage des Produits vendue par un etablissement pour avoir plus d'information.",
    "projectOsawMission7": "Conception du dashboard pour l'admnistrateur de l'application afin qu'il puisse gerer les societes, les annexes, les evenements et le produits en vente."
}