{
    "about": "About",
    "quality": "Quality",
    "greeting": "Hello!",
    "tech": "Tech Stack",
    "seeDemo": "See demo",
    "diplomas": "Dîplomes",
    "passion": "Passions",
    "parcour": "Education",
    "projects": "Projects",
    "missions": "Missions",
    "repository": "Repository",
    "experience":"Experiences",
    "myProjects": "My projects",
    "whatItDoes": "App Overview",
    "screenshoot": "Screenshoot",
    "Functionnality": "Functionnality",
    "academicCarrer": "Academic career",
    "professionalProjects": "Professional project",
    "experienceAndProjects": "Experiences & Projects",
    "description": "This is a simple React-Intl example.",
    "cvDescription": "As a full-stack developer, I am passionate about creation of innovative technological solutions to meet the needs of customers and end users. I am an expert in the design, development and maintenance of websites and applications, from front-end to back-end.",
    
    "projectVatsyOverview": "This app is designed to make restaurant management effortless and efficient. With its user-friendly and intuitive interface, staff can easily take orders, manage payments, and streamline everyday operations—all from one platform. The app ensures a smooth and fast service, allowing restaurants to focus on what matters most: providing a great dining experience. The app’s simple and reliable features help staff stay organized with real-time order tracking, stock management, and quick access to sales reports. It even keeps a clear transaction history, making financial tracking a breeze. Whether you're in a busy rush or need a quick update, everything is just a few taps away. With a focus on ease of use, this app is perfect for restaurants looking to enhance productivity and improve service quality. Plus, with built-in support and clear instructions.",
    "projectVatsyMission1": "Design and development of a restaurant management application with Tauri, React and SQlite",
    "projectVatsyMission2": "Implementation of an ergonomic and responsive user interface for taking orders and managing payments.",
    "projectVatsyMission3": "Integration of a 58 mm thermal printer with the escpos-rs library for printing additions.",
    "projectVatsyMission4": "Configuration and optimization of thermal printing parameters for reliable and fast rendering.",
    "projectVatsyMission5": "Testing and debugging to ensure a smooth user experience in real conditions.",
    "projectVatsyMission6": "Development of modules for inventory management, menus and orders in real time.",
    "projectVatsyMission7": "Implemented features for transaction history and daily sales reports.",
    "projectVatsyMission8": "Writing technical documentation to facilitate maintenance and future developments of the application.",
    "projectVatsyMission9": "Implementation of technical support for end users.",

    "projectVatsyInvoicePrinting": "Invoice printing",
    "projectVatsyOrderManagement": "Order Management",
    "projectVatsyTransactionHistory": "Transaction history",
    "projectVatsySearchEngine": "Search engine",

    "projectKonsistentOverview": "This is a Chrome extension, similar to Grammarly, designed to facilitate communication between staff members across various organizations. Its primary purpose is to prevent sexual harassment, moral harassment, and exclusion in the workplace. The extension is available on both web and desktop platforms.",
    "projectKonsistentMission1": "Addition of new exclusion rules based on message sending times, in order to prevent messages from being sent too late or too early, thereby protecting the privacy of employees.",
    "projectKonsistentMission2": "Implementation of an asymmetric data encryption feature to ensure the security and confidentiality of information.",
    "projectKonsistentMission3": "Design and development of the project in desktop version, aimed at reaching a large number of users.",
    "projectKonsistentMission4": "Real-time detection of user input, ensuring accurate and immediate results.",
    "projectKonsistentMission5": "Adding Microsoft Outlook, Slack, and Welcome to the Jungle as analysis channels in the Chrome extension,expanding execution channels to reach a larger number of users."
}